<script setup>

</script>

<template>
    <div class="q-pa-md" style="max-width: 650px">
      <q-list>
        <q-expansion-item popup default-opened icon="emoji_events" label="Inbox" caption="«Кубок среди любительских команд — зона «Северо-Запад»">
          <q-separator />
          <q-card>
            <q-card-section>
              Межрегиональные спортивные соревнования «Кубок среди любительских команд — зона «Северо-Запад» по футболу среди мужских команд проводятся с 1997 года.<br>
              В 2023 году Кубок является зональным этапом всероссийских соревнований по футболу среди мужчин «Кубок среди любительских команд».<br>
              Победитель Кубка завоюет путевку в финальный турнир РФС «Кубок среди любительских команд» и получит право пройти процедуру лицензирования для участия во Второй лиге.<br>
              В турнире принимают участие команды любительских футбольных клубов, составленные из игроков, родившихся не ранее 2008 года.<br>
            </q-card-section>
          </q-card>
        </q-expansion-item>
      </q-list>
    </div>
</template>

<style scoped lang="sass">

</style>
