<template>
  <div class="q-pa-md">
    <q-card-section>
      <div class="text-h6 text-deep-orange-14 ">История ФК Север г. Мурманск</div>
      <div class="text-subtitle2 text-grey">Материал из Википедии — свободной энциклопедии.</div>
      <q-img :src="require('assets/image/imgTitle/title_0.png' )" style="max-height: 450px; max-width: 450px"/>
    </q-card-section>
    <q-stepper
      v-model="step"
      ref="stepper"
      color="primary"
      header-nav
      animated
    >
      <q-step
        :name="1"
        title="Начало"
        caption="1961-1984"
        icon="settings"
        :error="step < 3"
        :done="step > 1"
      >
        <div class="text-h7">
          <p>Основан 1 марта 1961 году под названием «Тралфлотовец».</p>
          <p>Дебют в турнире класса «Б», где выступали команды Северо-Запада и центра РСФСР, не удался — лишь 11-е место из 13 участников.</p>
          <p>В 1965 году команду переименовали в «Север». Наивысшим достижением мурманских футболистов было второе место в зональных соревнованиях 1968 года. Тогда «Север» вышел в полуфинальную часть чемпионата СССР среди команд класса «Б» в зоне РСФСР.
            Полуфинальный турнир проходил в Пятигорске. Итог выступления заполярных футболистов — третье место. «Север» проиграл пятигорскому «Машуку» — 0:1, майкопской «Дружбе» — 0:5 и победил «Олимп» из подмосковного Фрязино — 3:0.</p>
          <p>С 1971 года после того, как произошла реорганизация чемпионата страны, «Север» получил «прописку» во второй лиге, выступая с переменным успехом.</p>
          <p>В 1984 году решением ВЦСПС, который проводил зональный турнир, три команды РСФСР, имеющие худшие результаты покидали вторую лигу и переходили в разряд КФК. Эта участь постигла горьковскую «Волгу», «Волжанин» из Кинешмы и мурманский «Север», который занял последнее место. Этот сезон стал последним для команды из Мурманска в первенстве страны.</p>
        </div>
      </q-step>

      <q-step
        :name="2"
        title="Первое возрождение"
        caption="2006-2015"
        icon="control_point"
        :done="step > 2"
      >
        <div class="text-h7">
          <p>В 2007 году клуб занял 1-е место в первенстве МРО «Северо-Запад» любительского первенства России.</p>
          <p>С 2008 года в течение пяти сезонов «Север» выступал в зоне «Запад» второго дивизиона (Первенство ПФЛ).</p>
          <p>Руководство Мурманской области готово было выделить на содержание клуба лишь 22,5 миллиона рублей при необходимых для выступления на уровне второго дивизиона ПФЛ 35 млн рублей. Попытки найти спонсоров успехом не увенчались.</p>
          <p>10 апреля 2015 на сайте МРО «Северо-Запад» появилась информация, что ФК «Север» подтвердил своё участие в розыгрыше первенства региона в сезоне 2015.</p>
          Вновь сформирован в 2006 году. Заявился в ЛФЛ. В сезоне 2006 года команда стала обладателем Кубка России среди ЛФК в зоне МРО «Северо-Запад».
        </div>
      </q-step>

      <q-step
        :name="3"
        title="Сейчас"
        caption="2022-наст.время"
        icon="control_point"
      >
        <div class="text-h7">
          <p>В январе 2022 года появилась информация о возрождении клуба на любительском уровне для участия в Третьем дивизионе в зоне ОФФ «Северо-Запад». Главным тренером был назначен бывший футболист «северян» Александр Петухов. Формирование команды произошло на базе петербургского любительского клуба «Константиновское». Также на роль спортивного директора был назначен Адьям Кузяев, когда-то тренировавший сам «Север». В рамках подготовки к сезону команда заявилась на Турнир уполномоченного представителя президента в Северо-Западном федеральном округе.</p>
          <p>2023 - Победа в чемпионта СЗФО. По итогам сезона часть команды ушла.</p>
          <p>2024 - Участие в XXV турнир полпреда СЗФО.</p>
        </div>
      </q-step>

      <template v-slot:navigation>
        <q-stepper-navigation>
          <q-btn @click="$refs.stepper.next()" color="primary" :label="step === 3 ? 'Конец' : 'Далее'" />
          <q-btn v-if="step > 1" flat color="primary" @click="$refs.stepper.previous()" label="Назад" class="q-ml-sm" />
        </q-stepper-navigation>
      </template>
    </q-stepper>
  </div>
</template>

<script>
import { ref } from 'vue'
export default {
  name: 'HistoryClubCard',
  setup () {
    return {
      step: ref(1)
    }
  }
}
</script>

<style scoped>

</style>
