<template>
  <div class="q-pa-md">
    <q-layout view="lHh lpr lFf" container style="height: 800px" class="shadow-2 rounded-borders">
      <q-header elevated>
        <q-toolbar>
          <q-avatar>
            <img  alt="logo" src="https://cdn.quasar.dev/logo-v2/svg/logo-mono-white.svg">
          </q-avatar>

          <q-toolbar-title>
            История футбольного клуба
          </q-toolbar-title>

          <q-btn flat round dense icon="whatshot" />
        </q-toolbar>
      </q-header>

      <q-page-container>
        <q-page padding>
          <p v-for="n in 1" :key="n">
            История ФК Север г. Мурманск <br>
            Основан 1 марта 1961 году под названием «Тралфлотовец». <br>
            Дебют в турнире класса «Б», где выступали команды Северо-Запада и центра РСФСР, не удался — лишь 11-е место из 13 участников. <br>
            В 1965 году команду переименовали в «Север». Наивысшим достижением мурманских футболистов было второе место в зональных соревнованиях 1968 года. Тогда «Север» вышел в полуфинальную часть чемпионата СССР среди команд класса «Б» в зоне РСФСР.
            Полуфинальный турнир проходил в Пятигорске. Итог выступления заполярных футболистов — третье место. «Север» проиграл пятигорскому «Машуку» — 0:1, майкопской «Дружбе» — 0:5 и победил «Олимп» из подмосковного Фрязино — 3:0.<br>
            С 1971 года после того, как произошла реорганизация чемпионата страны, «Север» получил «прописку» во второй лиге, выступая с переменным успехом.
            В 1984 году решением ВЦСПС, который проводил зональный турнир, три команды РСФСР, имеющие худшие результаты покидали вторую лигу и переходили в разряд КФК. Эта участь постигла горьковскую «Волгу», «Волжанин» из Кинешмы и мурманский «Север», который занял последнее место. Этот сезон стал последним для команды из Мурманска в первенстве страны.<br>
            Вновь сформирован в 2006 году. Заявился в ЛФЛ. В сезоне 2006 года команда стала обладателем Кубка России среди ЛФК в зоне МРО «Северо-Запад».<br>
            В 2007 году клуб занял 1-е место в первенстве МРО «Северо-Запад» любительского первенства России.<br>
            С 2008 года в течение пяти сезонов «Север» выступал в зоне «Запад» второго дивизиона (Первенство ПФЛ).<br>
            6 июня 2014 года у всех участников клуба закончились контракты. Было объявлено о расформировании клуба. Причиной стало недостаточное финансирование команды.
            Руководство Мурманской области готово было выделить на содержание клуба лишь 22,5 миллиона рублей при необходимых для выступления на уровне второго дивизиона ПФЛ 35 млн рублей. Попытки найти спонсоров успехом не увенчались.<br>
            10 апреля 2015 на сайте МРО «Северо-Запад» появилась информация, что ФК «Север» подтвердил своё участие в розыгрыше первенства региона в сезоне 2015.<br>
            В январе 2022 года появилась информация о возрождении клуба на любительском уровне для участия в Третьем дивизионе в зоне ОФФ «Северо-Запад».<br>
            Главным тренером был назначен бывший футболист «северян» Александр Петухов. <br>
            Формирование команды произошло на базе петербургского любительского клуба «Константиновское». Также на роль спортивного директора был назначен Адьям Кузяев, когда-то тренировавший сам «Север». В рамках подготовки к сезону команда заявилась на Турнир уполномоченного представителя президента в Северо-Западном федеральном округе. <br><br>
            Материал из Википедии — свободной энциклопедии.
          </p>
        </q-page>
      </q-page-container>
    </q-layout>
  </div>
</template>

<script>
import { defineComponent } from 'vue'

export default defineComponent({
  name: 'PageIndex'
})
</script>
